# CannotPasteAssemblyView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteAssemblyView Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste assembly view because its associated assembly instance is not available.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteAssemblyView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteAssemblyView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteAssemblyView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace